<!-- dflook/terraform-github-actions {"workspace":"tf-1-3-0-backend-version-detection","backend":"6627ee1bbe8affb088baddd7dc8b9e0d32d0326ab963eb17be6083d677fadf46","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #246 at https://github.com/dflook/terraform-github-actions/actions/runs/3122832201","plan_hash":"81fcd3d641aa769f8ad344589723cdad596e8bc492a69058e848cf7e1e26e882","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tf-1-3-0-backend-version-detection__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "VtT7elmH1p" -> (known after apply)
  ~ foreach = "bNyklNemcY" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #246](https://github.com/dflook/terraform-github-actions/actions/runs/3122832201)